#Дана непустая строка. Вывести коды ее первого и последнего символа.
Simv = str(input("введите вашу строку "))
print("Код первого символа:", ord(Simv[0]))
print("Код последнего символа:", ord(Simv[-1]))
